engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
    // CPOL and CPHA setting
    if (config->cpol) {
        cr1_mask |= SPI_CR1_CPOL;
    } else {
        cr1_mask &= ~SPI_CR1_CPOL;
    }

    if (config->cpha) {
        cr1_mask |= SPI_CR1_CPHA;
    } else {
        cr1_mask &= ~SPI_CR1_CPHA;
    }

    if (config->data_size == SPI_DATA_SIZE_8_BITS) {
        cr1_mask &= ~SPI_CR1_DFF;
    } else {
        cr1_mask |= SPI_CR1_DFF;
    }

    // Write the final mask
    handle->CR1 = cr1_mask;

    // Motorolla mode and SS output disable
    handle->CR2 &= ~(SPI_CR2_FRF | SPI_CR2_SSOE);

    return HAL_OK;
}

hal_err_t spi_master_dma_init(SPI_TypeDef* handle, dma_priority_t priority, bool init) {
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // TX mapping
    DMA_Stream_TypeDef* tx_stream  = s_spi_i2s_dma_map[idx].tx.stream;
    const uint8_t       tx_channel = s_spi_i2s_dma_map[idx].tx.channel;

    // RX mapping
    DMA_Stream_TypeDef* rx_stream  = s_spi_i2s_dma_map[idx].rx.stream;
    const uint8_t       rx_channel = s_spi_i2s_dma_map[idx].rx.channel;

    if (tx_stream == NULL || rx_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // The DFF bit being set means a 16 bit transfer
    const dma_data_size_t dma_data_size = (handle->CR1 & SPI_CR1_DFF) ? DMA_SIZE_HWORD : DMA_SIZE_BYTE;

    // DMA TX stream configuration
    dma_stream_config_t tx_stream_config = {
        .deconfigure   = false,
        .enable_stream = false,

        .per_addr_incement = false,
        .mem_addr_incement = true,

        .tc_irq_enable  = true,
        .ht_irq_enable  = false,
        .te_irq_enable  = true,
        .dme_irq_enable = true,
        .fe_irq_enable  = false,

        .mode            = DMA_MODE_DIRECT,
        .priority        = priority,
        .direction       = DMA_DIR_M_P,
        .per_data_size   = dma_data_size,
        .mem_data_size   = dma_data_size,
        .circular_mode   = DMA_MODE_NO_CIRCULAR,
        .flow_controller = DMA_FLOW_CONTROLLER_DMA,

        .buffer_size       = 0,
        .channel           = tx_channel,
        .nvic_irq_priority = SPI_DMA_NVIC_IRQ_PRIORITY,

        .per_addr  = NULL,
        .mem_buf_0 = NULL,
        .mem_buf_1 = NULL,

    };

    // DMA RX stream configuration
    dma_stream_config_t rx_stream_config = {
        .deconfigure   = false,
        .enable_stream = false,

        .per_addr_incement = false,
        .mem_addr_incement = true,

        .tc_irq_enable  = true,
        .ht_irq_enable  = false,
        .te_irq_enable  = true,
        .dme_irq_enable = true,
        .fe_irq_enable  = false,

        .mode            = DMA_MODE_DIRECT,
        .priority        = priority,
        .direction       = DMA_DIR_P_M,
        .per_data_size   = dma_data_size,
        .mem_data_size   = dma_data_size,
        .circular_mode   = DMA_MODE_NO_CIRCULAR,
        .flow_controller = DMA_FLOW_CONTROLLER_DMA,

        .buffer_size       = 0,
        .channel           = rx_channel,
        .nvic_irq_priority = SPI_DMA_NVIC_IRQ_PRIORITY,

        .per_addr  = NULL,
        .mem_buf_0 = NULL,
        .mem_buf_1 = NULL,

    };

    if (init) {
        // Enable SPI requests to the DMA controller
        handle->CR2 |= (SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);
    } else {
        // Disable SPI requests to the DMA controller
        handle->CR2 &= ~(SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);
        // Set the deconfigure flags so dma_configure_stream(...) deinitializes the streams
        tx_stream_config.deconfigure = true;
        rx_stream_config.deconfigure = true;
    }

    TRY(dma_configure_stream(tx_stream, &tx_stream_config));
    TRY(dma_configure_stream(rx_stream, &rx_stream_config));

    return HAL_OK;
}


// Polling API
hal_err_t spi_master_transmit_poll(SPI_TypeDef* handle, const void* data, size_t size) {
    if (handle == NULL || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    ENABLE_SPI();
    hal_err_t error = HAL_OK;

    // The DFF bit being set means a 16 bit transfer
    if (handle->CR1 & SPI_CR1_DFF) {
        // Cast to appropriate type
        const uint16_t* buf = (const uint16_t*)data;

        for (size_t i = 0; i < size; i++) {
            // Write the data
            handle->DR = buf[i];

            // Poll till the data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Poll till the data has been received
            timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_RXNE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Read the data register and discard the value
            (void)handle->DR;
        }

    } else {
        // Cast to appropriate type
        const uint8_t* buf = (const uint8_t*)data;

        for (size_t i = 0; i < size; i++) {
            // Write the data
            handle->DR = buf[i];

            // Poll till data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Wait till data has been received
            timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_RXNE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Read the data register and discard the value
            (void)handle->DR;
        }
    }

    // Wait for the TXE and BSY bits
    // TXE bit
    uint32_t timeout = TIMEOUT_CYCLES;
    while (!(handle->SR & SPI_SR_TXE) && (--timeout));
    if (timeout == 0) {
        error = HAL_ERR_TIMEOUT;
        goto done;
    }

    // BSY bit
    timeout = TIMEOUT_CYCLES;
    while ((handle->SR & SPI_SR_BSY) && (--timeout));
    if (timeout == 0) {
        error = HAL_ERR_TIMEOUT;
    }

done:
    DISABLE_SPI();
    return error;
}

hal_err_t spi_master_receive_poll(SPI_TypeDef* handle, void* data, size_t size) {
    if (handle == NULL || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

