engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
    ENABLE_SPI();
    hal_err_t error = HAL_OK;

    // The DFF bit being set means a 16 bit transfer
    if (handle->CR1 & SPI_CR1_DFF) {
        // Cast to appropriate type
        uint16_t* buf = (uint16_t*)data;

        for (size_t i = 0; i < size; i++) {
            // Write dummy data
            handle->DR = 0;

            // Poll till the data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Poll till the data has been received
            timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_RXNE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Finally, read the data register
            buf[i] = (uint16_t)handle->DR;
        }

    } else {
        // Cast to appropriate type
        uint8_t* buf = (uint8_t*)data;

        for (size_t i = 0; i < size; i++) {
            // Write dummy data
            handle->DR = 0;

            // Poll till data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Wait till data has been received
            timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_RXNE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Finally, read the data register
            buf[i] = (uint8_t)handle->DR;
        }
    }

    // Wait for the TXE and BSY bits
    // TXE bit
    uint32_t timeout = TIMEOUT_CYCLES;
    while (!(handle->SR & SPI_SR_TXE) && (--timeout));
    if (timeout == 0) {
        error = HAL_ERR_TIMEOUT;
        goto done;
    }

    // BSY bit
    timeout = TIMEOUT_CYCLES;
    while ((handle->SR & SPI_SR_BSY) && (--timeout));
    if (timeout == 0) {
        error = HAL_ERR_TIMEOUT;
    }

done:
    DISABLE_SPI();
    return error;
}

hal_err_t spi_master_transceive_poll(SPI_TypeDef* handle, const void* tx_data, void* rx_data, size_t size) {
    if (handle == NULL || tx_data == NULL || rx_data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    ENABLE_SPI();
    hal_err_t error = HAL_OK;

    // The DFF bit being set means a 16 bit transfer
    if (handle->CR1 & SPI_CR1_DFF) {
        // Cast to appropriate type
        const uint16_t* tx_buf = (const uint16_t*)tx_data;
        uint16_t*       rx_buf = (uint16_t*)rx_data;

        for (size_t i = 0; i < size; i++) {
            // Write the data
            handle->DR = tx_buf[i];

            // Poll till data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Poll till the data has been received
            timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_RXNE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Finally, read the data register
            rx_buf[i] = (uint16_t)handle->DR;
        }

    } else {
        // Cast to appropriate type
        const uint8_t* tx_buf = (const uint8_t*)tx_data;
        uint8_t*       rx_buf = (uint8_t*)rx_data;

        for (size_t i = 0; i < size; i++) {
            // Write the data
            handle->DR = tx_buf[i];

            // Poll till data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Wait till the data has been received
            timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_RXNE) && (--timeout));
            if (timeout == 0) {
                error = HAL_ERR_TIMEOUT;
                goto done;
            }

            // Finally, read the data register
            rx_buf[i] = (uint8_t)handle->DR;
        }
    }

    // Wait for the TXE and BSY bits
    // TXE bit
    uint32_t timeout = TIMEOUT_CYCLES;
    while (!(handle->SR & SPI_SR_TXE) && (--timeout));
    if (timeout == 0) {
        error = HAL_ERR_TIMEOUT;
        goto done;
    }

    // BSY bit
    timeout = TIMEOUT_CYCLES;
    while ((handle->SR & SPI_SR_BSY) && (--timeout));
    if (timeout == 0) {
        error = HAL_ERR_TIMEOUT;
    }

done:
    DISABLE_SPI();
    return error;
}


// DMA transfers API
hal_err_t spi_master_transmit_dma(SPI_TypeDef* handle, const void* data, uint16_t size, dma_done_cb_t cb, void* arg) {
    // Get index for DMA stream mapping
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    // TX mapping
    DMA_Stream_TypeDef* stream = s_spi_i2s_dma_map[idx].tx.stream;
    if (stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Set the memory address and transaction length
    dma_set_addresses(stream, &handle->DR, data, NULL);
    dma_set_trans_length(stream, size);

    // Save the user passed callback
    if (cb) {
        s_dma_stream_ctx[idx].tx.callback = cb;
        s_dma_stream_ctx[idx].tx.arg      = arg;
    }

    // Enable the DMA TX stream
    TRY(dma_enable_stream(stream));

    ENABLE_SPI();
    return HAL_OK;
}

hal_err_t spi_master_receive_dma(SPI_TypeDef* handle, void* data, uint16_t size, dma_done_cb_t cb, void* arg) {
    // Get index for DMA stream mapping
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    // RX mapping
    DMA_Stream_TypeDef* stream = s_spi_i2s_dma_map[idx].rx.stream;
    if (stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Set the memory address and transaction length
    dma_set_addresses(stream, &handle->DR, data, NULL);
    dma_set_trans_length(stream, size);

    // Save the user passed callback
    if (cb) {
        s_dma_stream_ctx[idx].rx.callback = cb;
        s_dma_stream_ctx[idx].rx.arg      = arg;
    }

    // Enable the DMA TX stream
    TRY(dma_enable_stream(stream));

